Repository: CrEagleOne/dbtective
Catalog: docs/_build/locale/*/LC_MESSAGES/source/compare.po
Languages: fr

source: Compare data from 2 databases
fr: Comparer les données de 2 bases de données

source: Configuring Compare Settings
fr: Configuration des paramètres de comparaison

source: Settings
fr: Paramètres

source: Database 1 and Database 2
fr: Base de données 1 et 2

source: Choose the databases to compare
fr: Choisisser les bases de données à comparer

source: Multiple queries
fr: Requêtes multiples

source: Defines the method of data extraction (Single query if off)
fr: Définit la méthode d'extraction des données (requête unique si désactivée)

source: Segment length
fr: Taille du segment

source: The size of data segments to be extracted at a time (active if multiple queries is on)
fr: La taille des segments de données à extraire à la fois (actifs s'ils sont multiplesles requêtes sont activées)

source: Fetch Size
fr: Taille du fetch

source: Number of rows the driver retrieves in one batch from the database
fr: Nombre de lignes récupérées par le pilote dans un lot de la base de données

source: Processing mode
fr: Mode de traitement

source: Choice of treatment method (see processing below)
fr: Choix de la méthode de traitement (voir traitement ci-dessous)

source: List of tables
fr: Liste des tables

source: Contents of a database (see details below)
fr: Contenu d'une base de données (voir détails ci-dessous)

source: Processing
fr: Traitement

source: By hash
fr: Par hachage

source: Each extracted line will be hashed and update a hashed value. No details possible, it will just be possible to know if there were any discrepancies or not.
fr: Chaque ligne extraite sera hachée et mettra à jour une valeur hachée. Pas de détails possible, il sera juste possible de savoir s'il y a eu des écarts.

source: By lines
fr: Par lignes

source: Each extracted line will be added to a temporary database (via duckDB) and the comparison query will be launched. For each table with at least one data gap, a csv format file will be generated.
fr: Chaque ligne extraite sera ajoutée à une base de données temporaire (via duckDB)et la requête de comparaison sera lancée. Pour chaque table avec au moins un écart dans les données, un fichier au format csv sera généré.

source: By columns
fr: Par colonnes

source: Same as for the process « By lines », but using the « Levenshtein distance » to retrieve data peers.
fr: Identique au processus « Par lignes », mais en utilisant la « distance de Levenshtein »pour récupérer les données qui vont de pairs.

source: It is a mathematical distance between 2 character strings, defined as the minimum number of single-character modifications (insertions, deletions or substitutions) necessary to change one sequence to another.
fr: Il s'agit d'une distance mathématique entre 2 chaînes de caractères, définie comme le nombre minimum de modifications à un seul caractère (insertions, suppressions ou des substitutions) nécessaires pour changer une séquence en une autre.

source: Details
fr: Détails

source: Displays the list of common tables between the 2 selected databases.
fr: Affiche la liste des tables communes entre les 2 bases de données sélectionnées.

source: By pressing "DELETE" on the keyboard, the table associated with the selected row will not be compared. To add the table again, press "Backspace".
fr: En appuyant sur "DELETE" sur le clavier, la table associée à la ligne sélectionnée ne sera pas comparée. Pour ajouter à nouveau la table, appuyer sur "Retour arrière".

source: CSV files
fr: Fichiers CSV

source: Each CSV file to be processed in the comparison must adhere to the following rules:
fr: Chaque fichier CSV à traiter lors de la comparaison doit respecter les règles suivantes:

source: The file name must be identical
fr: Le nom du fichier doit être identique

source: To the name of the table to be compared for a database comparison
fr: Au nom de la table à comparer pour une comparaison de base de données

source: To the name of the other file for a comparison with another file
fr: Au nom de l'autre fichier pour une comparaison avec un autre fichier

source: Must contain the column names in the header
fr: Doit contenir les noms de colonnes dans l'en-tête

source: Ensure the consistency of the exported data
fr: S'assurer de la cohérence des données exportées
