Repository: CrEagleOne/dbtective
Catalog: docs/_build/locale/*/LC_MESSAGES/source/core.utils.po
Languages: fr

source: core.utils package
fr: Package core.utils

source: Submodules
fr: Sous-modules

source: core.utils.common module
fr: Module core.utils.common

source: This module contains functions to manage technical tables
fr: Ce module contient des fonctions pour gérer les tables systèmes

source: Dependencies:
fr: Dépendances:

source: Usage Example:
fr: Example d'utilisation:

source: Compare pairs of comma-separated strings and return the symmetric difference between their elements
fr: Comparer des paires de chaînes séparées par des virgules et renvoyer la différence symétrique entre leurs éléments

source: A list of tuples, where each tuple contains two comma-separated strings to compare
fr: Une liste de tuples, où chaque tuple à comparer contiennent deux chaînes séparées par des virgules

source: A list of tuples : - The original pair of strings - A set containing the symmetric difference between elements of both strings
fr: Une liste de tuples : - La paire de chaînes d'origine - Un ensemble contenant la différence symétrique entre les éléments des deux chaines

source: A list of tuples :
fr: Une liste de tuples :

source: The original pair of strings
fr: La paire de chaines originale

source: A set containing the symmetric difference between elements
fr: Un ensemble contenant la différence symétrique entre les éléments

source: of both strings
fr: des deux chaines

source: Create a csv file containing the data discrepancies
fr: Créer un fichier csv contenant les écarts de données

source: Path of the file to write
fr: Chemin du fichier de sortie

source: Data to write
fr: Données à écrire

source: Deletes all files and subdirectories inside a temporary work folder and recreates an empty version of it
fr: Supprime tous les fichiers et sous-répertoires dans le dossier de travail temporaire et recrée une version vide de ces derniers

source: The relative path inside the 'dbtective' temp directory to be purged
fr: Le chemin relatif à l'intérieur du répertoire temporaire 'dbtective' à purger

source: Extract data to a CSV file
fr: Extraire des données dans un fichier CSV

source: Database configuration
fr: Configuration de la base de données

source: Tablename
fr: Nom de la table

source: Output file name
fr: Nom du fichier de sortie

source: Finds the most similar pairs in a DataFrame column using Levenshtein distance
fr: Trouve les paires les plus similaires dans une colonne DataFrame à l'aide de la distance de Levenshtein

source: The DataFrame containing the column to compare
fr: Le DataFrame contenant la colonne à comparer

source: The name of the column, defaults to 'merged'
fr: Le nom de la colonne, par défaut « merged »

source: Retrieves all available locales from the specified directory
fr: Récupère toutes les traductions disponibles à partir du répertoire spécifié

source: The path to the directory containing locale files
fr: Le chemin d'accès au répertoire contenant les fichiers de traductions

source: A list of available locales, with the current locale first
fr: Une liste des traductions disponibles, avec le langage actuel en premier

source: Retrieve the common tables of 2 bases
fr: Récupérer les tables communes de 2 bases

source: Database 1 configuration
fr: Configuration de la base de données 1

source: Database 2 configuration
fr: Configuration de la base de données 2

source: Common tables
fr: Tables communes

source: Retrieves the current locale setting from the configuration
fr: Récupère la langue choisie par l'utilisateur

source: The current locale setting
fr: La langue trouvée

source: Filenmae
fr: Récupère la taille du fichier et choisit dynamiquement l'unité la plus appropriée

source: File size with the most suitable unit
fr: Taille du fichier avec l'unité la plus adaptée

source: Calculate the hash of a file using the specified algorithm
fr: Calculer le hachage d'un fichier à l'aide de l'algorithme spécifié

source: File hash
fr: Hachage de fichiers

source: Retrieve the list of tables, their size, the number of columns and rows
fr: Récupérer la liste des tables, leur taille, le nombre de colonnes et de lignes

source: Database config
fr: Configuration de la base de données

source: Database content
fr: Contenu de la base de données

source: Get the working file path inside the system's temporary directory
fr: Obtener le chemin du fichier de travail dans le répertoire temporaire du système

source: The full path inside the temporary workspace
fr: Le chemin relatif à l'intérieur du répertoire de travail

source: Get the working folder path inside the system's temporary directory Creates the folder if it does not exist
fr: Obtener le chemin du dossier de travail dans le répertoire temporaire du système Créer le dossier s'il n'existe pas

source: Calculate the Levenshtein distance between two strings
fr: Calculer la distance de Levenshtein entre deux chaînes

source: The Levenshtein distance is a measure of the difference between two sequences, which is defined as the minimum number of single-character edits (insertions, deletions, or substitutions) required to change one sequence into the other
fr: La distance de Levenshtein est une mesure de la différence entre deux séquences, qui sont définies comme le nombre minimum de caractères uniques modifications (insertions, suppressions ou substitutions) nécessaires pour modifier une séquence en une autre

source: Parameters: s1 (str): The first string to compare s2 (str): The second string to compare
fr: Paramètres : s1 (str) : La première chaîne pour comparer s2 (str) : La seconde chaîne à comparer

source: Returns: int: The Levenshtein distance between s1 and s2
fr: Renvoie : int : La distance de Levenshtein entre s1 et s2

source: Converts a pandas Series row into a comma-separated string
fr: Convertir une ligne de la série pandas en une chaîne séparée par des virgules

source: A pandas row containing values to merge
fr: Une ligne pandas contenant des valeurs à fusionner

source: A single string with all row values joined by commas
fr: Une seule chaîne avec toutes les valeurs de ligne jointes par des virgules

source: Merges data from 2 dict for each common key
fr: Fusionner les données de 2 dict pour chaque clé commune

source: Merge dict
fr: dict fusionné

source: Returns the absolute path to a resource file based on the current directory
fr: Renvoie le chemin absolu vers un fichier de ressources en fonction du répertoire actuel

source: If the application is built with PyInstaller, this function returns the path to the _MEIPASS folder to find resource files Otherwise, this function returns the path to the current directory to find resource files
fr: Si l'application est construite avec PyInstaller, cette fonction renvoie le chemin vers le dossier _MEIPASS pour trouver les fichiers de ressources Sinon, la fonction renvoie le chemin d'accès au répertoire actuel pour trouver les fichiers de ressources

source: Parameters :
fr: Paramètres:

source: Returns :
fr: Renvoie:

source: Returns the absolute path to an image used in the graphical user interface
fr: Renvoie le chemin absolu vers une image utilisée dans l'interface utilisateur graphique

source: Returns the absolute path of the application translation file
fr: Renvoie le chemin absolu du fichier de traduction de l'application

source: Returns the absolute path to an SVG image used in the graphical user interface
fr: Renvoie le chemin absolu vers une image SVG définie dans l'interface utilisateur

source: Modify a widget's stylesheet by updating or adding a CSS property
fr: Modifier la feuille de style d'un widget en mettant à jour ou en ajoutant une propriété CSS

source: Target widget to update
fr: Widget cible à mettre à jour

source: CSS property name (e.g., "background-color")
fr: Nom de la propriété CSS (par exemple, "background-color")

source: New value for the property (e.g., "red", "20px")
fr: Nouvelle valeur pour la propriété (par exemple, "red", "20px")

source: If the property exists, its value is replaced
fr: Si la propriété existe, sa valeur est remplacée

source: If absent, the property is appended to the stylesheet
fr: En cas d'absence, la propriété est ajoutée à la feuille de style

source: core.utils.config module
fr: Module core.utils.config

source: Recover saved database settings
fr: Récupérer les paramètres de base de données enregistrés

source: Query to perform
fr: Requête à effectuer

source: Query result
fr: résultat de la requête

source: Retrieves the language
fr: Récupère la langue

source: Insert a new database settings
fr: Insérer de nouveaux paramètres de base de données

source: Query args
fr: Arguments de requête

source: Return code
fr: Code retour

source: Prepare the app database
fr: Préparer la base de données de l'application

source: Updates the language
fr: Met à jour la langue

source: core.utils.exceptions module
fr: Module core.utils.exceptions

source: This module contains functions to manage custom exceptions
fr: Ce module contient des fonctions pour gérer les exceptions personnalisées

source: Custom exception class that integrates logging and Qt error signaling
fr: Classe d'exception personnalisée qui intègre la journalisation et la signalisation d'erreur Qt

source: Initializes the exception with an error message and triggers error logging
fr: Initialise l'exception avec un message d'erreur et déclenche la journalisation des erreurs

source: The error code used to fetch the corresponding message Possible values: - 400: Poorly formed or invalid SQL query - 401: An error was occured - 402: UNIQUE constraint failed - 403: Syntax error - 404: Table or column not found - 405: Incorrect database config - 406: Data type mismatch - 407: Conversion error - 408: Transaction error - 500: Failed to connect to database - 501: Database temporarily unavailable - 502: Out of memory error - 503: Disk I/O error - 504: No active Oracle listener - 505: Account locked - 506: Incorrect username or password - 600: System not supported - 601: Settings file not found - 602: Themes file not found - 603: No tables to compare - 604: Error occurring during data extraction - 999: Unanticipated error - check logs
fr: Le code d'erreur utilisé pour récupérer le message correspondant Valeurs possibles : - 400 : Requête SQL mal formée ou non valide - 401 : Une erreur est survenue - 402 : échec de la contrainte UNIQUE - 403 : erreur de syntaxe - 404 : Table ou colonne introuvable - 405 : Configuration incorrecte de la base de données - 406 : Incompatibilité de type de données - 407 : Erreur de conversion - 408 : Erreur de transaction - 500 : échec de connexion à la base de données - 501 : Base de données temporairement indisponible - 502 : erreur de manque de mémoire - 503 : Erreur d'E/S de disque - 504 : Aucun port d'écoute Oracle actif - 505 : Compte verrouillé - 506 : Nom d'utilisateur ou mot de passe incorrect - 600 : Système non pris en charge - 601 : Fichier de paramètres introuvable - 602 : Thème introuvable - 603 : Pas de tables à comparer - 604 : Erreur survenant lors de l'extraction des données - 999 : Erreur imprévue - vérifier les logs

source: The error code used to fetch the corresponding message
fr: Le code d'erreur utilisé pour récupérer le message correspondant

source: Possible values:
fr: Valeurs possibles :

source: 400: Poorly formed or invalid SQL query
fr: 400 : Requête SQL mal formée ou non valide

source: 401: An error was occured
fr: 401 : Une erreur est survenue

source: 402: UNIQUE constraint failed
fr: 402 : échec de la contrainte UNIQUE

source: 403: Syntax error
fr: 403 : erreur de syntaxe

source: 404: Table or column not found
fr: 404 : Table ou colonne introuvable

source: 405: Incorrect database config
fr: 405 : Configuration incorrecte de la base de données

source: 406: Data type mismatch
fr: 406 : Incompatibilité de type de données

source: 407: Conversion error
fr: 407 : Erreur de conversion

source: 408: Transaction error
fr: 408: Erreur de transaction

source: 500: Failed to connect to database
fr: 500 : échec de connexion à la base de données

source: 501: Database temporarily unavailable
fr: 501: Base de données temporairement indisponible

source: 502: Out of memory error
fr: 502 : erreur de manque de mémoire

source: 503: Disk I/O error
fr: 503 : Erreur d'E/S de disque

source: 504: No active Oracle listener
fr: 504 : Aucun port d'écoute Oracle actif

source: 505: Account locked
fr: 505: Compte verrouillé

source: 506: Incorrect username or password
fr: 506 : Nom d'utilisateur ou mot de passe incorrect

source: 600: System not supported
fr: 600: Système non pris en charge

source: 601: Settings file not found
fr: 601 : Fichier de paramètres introuvable

source: 602: Themes file not found
fr: 602: Thème introuvable

source: 603: No tables to compare
fr: 603 : Pas de tables à comparer

source: 604: Error occurring during data extraction
fr: 604: Erreur survenant lors de l'extraction des données

source: 999: Unanticipated error - check logs
fr: 999 : Erreur imprévue - vérifier les logs

source: System context for logging
fr: Contexte système pour la journalisation

source: A Qt object that provides an error signaling mechanism
fr: Un objet Qt qui fournit un mécanisme de signalisation d'erreur

source: Emits the error signal and logs the error message
fr: Émet le signal d'erreur et enregistre le message d'erreur

source: The error message to emit and log
fr: Le message d'erreur à émettre et à enregistrer

source: Triggers an error signal with the given message
fr: Déclenche un signal d'erreur avec le message donné

source: The error message to send
fr: Le message d'erreur à envoyer

source: Initializes the info with a message and triggers info signaling
fr: Initialise les informations avec un message et déclenche la signalisation des informations

source: The info code used to fetch the corresponding message Possible values: - 100: Backup successfully - 101: Backup successfully - 200: Treatment completed successfully - 201: No discrepancies were found
fr: Le code d'information utilisé pour récupérer le message correspondant Valeurs possibles : - 100 : Sauvegarde réussie - 101 : Sauvegarde réussie - 200 : Traitement terminé avec succès - 201 : Aucune divergence n'a été constatée

source: The info code used to fetch the corresponding message
fr: Le code d'information utilisé pour récupérer le message correspondant

source: 100: Backup successfully
fr: 100 : Sauvegarde réussie

source: 101: Backup successfully
fr: 101 : Sauvegarde réussie

source: 200: Treatment completed successfully
fr: 200: Traitement terminé avec succès

source: 201: No discrepancies were found
fr: 201 : Aucun écart n'a été constaté

source: Custom warning exception that integrates logging and Qt warning signaling
fr: Exception d'avertissement personnalisée qui intègre la journalisation et la signalisation d'avertissement Qt

source: Initializes the warning exception with a message and triggers warning signaling
fr: Initialise l'exception d'avertissement avec un message et déclenche un avertissement

source: The warn code used to fetch the corresponding message Possible values: 300: Discrepancies were found
fr: Le code d'avertissement utilisé pour récupérer le message correspondant Valeurs possibles : 300 : Des divergences ont été constatées

source: The warn code used to fetch the corresponding message
fr: Le code d'avertissement utilisé pour récupérer le message correspondant

source: 300: Discrepancies were found
fr: 300 : Des divergences ont été constatées

source: A Qt object that provides a warning signaling mechanism
fr: Un objet Qt qui fournit un mécanisme de signalisation d'avertissement

source: Emits the warning signal and logs the warning message
fr: Émet le signal d'avertissement et enregistre le message d'avertissement

source: The warning message to emit and log
fr: Le message d'avertissement à émettre et à enregistrer

source: Triggers a warning signal with the given message
fr: Déclenche un signal d'avertissement avec le message donné

source: The warning message to send
fr: Le message d'avertissement à envoyer

source: core.utils.logs module
fr: Module core.utils.logs

source: This module contains functions to manage logs
fr: Ce module contient des fonctions pour gérer les journaux

source: Configures the logging system based on user settings
fr: Configure le système de journalisation en fonction des paramètres utilisateur

source: Retrieves the log level from the settings
fr: Récupère le niveau de journalisation à partir des paramètres

source: Creates a temporary directory for log storage
fr: Crée un répertoire temporaire pour le stockage des journaux

source: Sets up logging with file and console handlers
fr: Configure la journalisation avec les gestionnaires de fichiers et de consoles

source: Log a message with the specified level
fr: Enregistrer un message avec le niveau spécifié

source: Log level ('error', 'info', 'warning', 'debug')
fr: Niveau de log ('error', 'info', 'warning', 'debug')

source: Message text
fr: Texte du message

source: core.utils.orders module
fr: Module core.utils.orders

source: This module contains functions to execute database comparaison
fr: Ce module contient des fonctions pour exécuter la comparaison de bases de données

source: Execute database comparaison
fr: Exécuter la comparaison de bases de données

source: Type of processing to perform
fr: Type de traitement à effectuer

source: Database connection parameters
fr: Paramètres de connexion à la base de données

source: Segment size
fr: Taille du segment

source: List of tables to compare
fr: Liste des tables à comparer

source: Fetch size
fr: Taille du fetch

source: code 300 (data gap)
fr: code 300 (Ecart de données)

source: code 603 (No tables to compare)
fr: code 603 (Aucune table à comparer)

source: code 201 (No data gap)
fr: code 201 (Aucun écart de données)

source: Module contents
fr: Contenu des modules
