Repository: CrEagleOne/dbtective
Catalog: docs/_build/locale/*/LC_MESSAGES/source/core.database.po
Languages: fr

source: core.database package
fr: Package core.database

source: Submodules
fr: Sous-modules

source: core.database.duck module
fr: Module core.database.duck

source: This module contains the functions to load and process comparison data
fr: Ce module contient les fonctions permettant de charger et de traiter des données de comparaison

source: Dependencies:
fr: Dépendances:

source: Usage Example:
fr: Exemple d'utilisation:

source: This module uses DuckDB for efficient in-memory SQL processing.
fr: Ce module utilise DuckDB pour un traitement SQL efficace en mémoire.

source: Designed for handling large datasets efficiently.
fr: Conçu pour gérer efficacement de grands ensembles de données.

source: Delete tmp duckDB database
fr: Supprimer la base de données temporaire de duckDB

source: Retrieves all rows as a data frame
fr: Récupère toutes les lignes sous forme de trame de données

source: SQL query
fr: Requête SQL

source: Query args
fr: Arguments de requête

source: Query result
fr: Résultat de requête

source: Load the contents of a file into the database
fr: Charger le contenu d'un fichier dans la base de données

source: Filename
fr: Nom du fichier

source: Name of the table
fr: Nom de la table

source: True if successful, False otherwise
fr: Vrai en cas de succès, Faux sinon

source: Retrieves the CSV delimiter from the file
fr: Récupère le délimiteur CSV du fichier

source: Delimiter
fr: Délimiteur

source: core.database.oracle module
fr: Module core.database.oracle

source: This module contains the functions allowing you to retrieve data from an oracle database
fr: Ce module contient les fonctions permettant de récupérer des données à partir d'une base de données oracle

source: This module uses oracledb thin mode
fr: Ce module utilise le mode thin oracledb

source: Designed for handling large datasets efficiently
fr: Conçu pour gérer efficacement de grands ensembles de données

source: Retrieve all datas from a query using segment and fetch
fr: Récupérez toutes les données d'une requête à l'aide de segment et fetch

source: Database connection
fr: Connexion à la base de données

source: How many rows are read per segment
fr: Combien de lignes sont lues par segment

source: Number of rows to fetch per reading
fr: Nombre de lignes à récupérer par lecture

source: Query to perform
fr: Requête à effectuer

source: Yields
fr: Retourne

source: *list* -- Segment data
fr: *liste* -- Données du segment

source: Retrieve all datas from a query
fr: Récupérer toutes les données d'une requête

source: list of error codes
fr: liste des codes d'erreur

source: Retrieve the first result of a query
fr: Récupérer le premier résultat d'une requête

source: Checks if the database connection is still active
fr: Vérifie si la connexion à la base de données est toujours active

source: Database configuration (unused but included for compatibility)
fr: Configuration de la base de données (inutilisée mais incluse pour des raisons de compatibilité)

source: Additional arguments, expecting a 'conn' key
fr: Arguments supplémentaires, attendue une clé « conn »

source: True if the connection is active, False otherwise
fr: Vrai si la connexion est active, Faux sinon

source: Module contents
fr: Contenu des modules
