Repository: CrEagleOne/dbtective
Catalog: docs/_build/locale/*/LC_MESSAGES/source/gui.widgets.po
Languages: fr

source: gui.widgets package
fr: Package gui.widgets

source: Submodules
fr: Sous-modules

source: gui.widgets.py\_checkbox module
fr: Module gui.widgets.py\_checkbox

source: gui.widgets.py\_circular\_progress module
fr: Module gui.widgets.py\_circular\_progress

source: gui.widgets.py\_combobox module
fr: Module gui.widgets.py\_combobox

source: gui.widgets.py\_grips module
fr: Module gui.widgets.py\_grips

source: gui.widgets.py\_icon\_button module
fr: Module gui.widgets.py\_icon\_button

source: gui.widgets.py\_label module
fr: Module gui.widgets.py\_label

source: gui.widgets.py\_left\_column module
fr: Module gui.widgets.py\_left\_column

source: gui.widgets.py\_left\_menu module
fr: Module gui.widgets.py\_left\_menu

source: gui.widgets.py\_line\_edit module
fr: Module gui.widgets.py\_line\_edit

source: gui.widgets.py\_logbar module
fr: Module gui.widgets.py\_logbar

source: gui.widgets.py\_push\_button module
fr: Module gui.widgets.py\_push\_button

source: gui.widgets.py\_radio\_button module
fr: Module gui.widgets.py\_radio\_button

source: gui.widgets.py\_slider module
fr: Module gui.widgets.py\_slider

source: gui.widgets.py\_table\_widget module
fr: Module gui.widgets.py\_table\_widget

source: gui.widgets.py\_title\_bar module
fr: Module gui.widgets.py\_title\_bar

source: gui.widgets.py\_toggle module
fr: Module gui.widgets.py\_toggle

source: gui.widgets.py\_tool\_button module
fr: Module gui.widgets.py\_tool\_button

source: gui.widgets.py\_window module
fr: Module gui.widgets.py\_window

source: Module contents
fr: Contenu des modules
