Repository: CrEagleOne/dbtective
Catalog: docs/_build/locale/*/LC_MESSAGES/source/new_connection.po
Languages: fr

source: Create a new connection
fr: Créer une nouvelle connexion

source: Configuring Connection Settings
fr: Configuration des paramètres de connexion

source: For all connections :
fr: Pour toutes les connexions :

source: Settings
fr: Paramètres

source: Test the Connection
fr: Créer une nouvelle connexion

source: Click Test Connection to verify if the connection works
fr: Tester la connexion : Cliquer sur Tester la connexion pour vérifier si la connexion fonctionne

source: Save
fr: Sauvegarder

source: Click Save. The connection appears in the database choices
fr: Enregistrer. Cliquer sur Enregistrer pour faire apparaître la connexion dans les choix de la base de données

source: Connection name
fr: Nom de la connexion

source: Assign a specific name to the connection for easier identification
fr: Attribuer un nom spécifique à la connexion pour une identification plus facile

source: Oracle connection settings
fr: Paramètres de connexion Oracle

source: Host
fr: Hôte

source: IP Address or Host Name
fr: Adresse IP ou nom de l'hôte

source: The port number for the connection (1521 by default)
fr: Le numéro de port pour la connexion (1521 par défaut)

source: Database
fr: Base de données

source: The name of the specific database you want to connect to
fr: Le nom de la base de données spécifique à laquelle vous souhaitez vous connecter

source: Username and Password
fr: Nom d'utilisateur et mot de passe

source: The credentials required for authentication
fr: Les informations d'identification requises pour l'authentification

source: CSV connection settings
fr: Paramètres de connexion CSV

source: Drag and drop or browse files
fr: Glisser-déposer ou parcourer les fichiers

source: Allowed extensions: csv
fr: Pour chaque fichier, une analyse structurelle est effectuée afin de garantir que son contenu est bien structuré en tableau (en-tête, séparateur, etc.). Si au moins un fichier est incorrect (extension incorrecte ou contenu incohérent), ce fichier sera ignoré et une alerte s'affichera à l'écran.
